# ParameterOnSecondCurve Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ClosestPointsPairBetweenTwoCurves..::..ParameterOnSecondCurve Property
ClosestPointsPairBetweenTwoCurves Class See Also
---
1d raw (not normalized) parameter of the point on the second curve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public double ParameterOnSecondCurve { get; set; }
```

Visual Basic
---
```text
Public Property ParameterOnSecondCurve As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double ParameterOnSecondCurve {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The property has not been set by the method providing the result. |

# See Also
ClosestPointsPairBetweenTwoCurves Class
Autodesk.Revit.DB Namespace